In [2]:
%load_ext sql

### aktif hale getirdik

sql komutları içerisinde comment yazınca hata dönüyor

In [13]:
%sql sqlite:///assignment.db-journal  # bu function ile databasemize bağlandık

'Connected: @assignment.db-journal'

In [15]:
%%sql
SELECT * FROM employeetable;

# aynı şekilde bağlantı notebook üzerinden sorgu yaptık 
# burada bilerek büyük yazdık ayırt etmek için hangilerinin query olduklarını

   sqlite:///assignment.db
 * sqlite:///assignment.db-journal
(sqlite3.OperationalError) no such table: employeetable
[SQL: SELECT * FROM employeetable;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

### Manuel Tablo Oluşturma İşlemleri

In [5]:
%%sql
CREATE TABLE yeni_tablo(firstname varchar(20),
                       lastname varchar(20)) ;
# kaç karakterden oluşmasını istiyorsak varchar onun için

 * sqlite:///veri_tabanları_sql.db
Done.
(sqlite3.OperationalError) unrecognized token: "#"
[SQL: # kaç karakterden oluşmasını istiyorsak varchar onun için]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [8]:
%%sql
INSERT INTO yeni_tablo values('ali', 'uzaya_git');
# veri tabanına bir satır eklemiş olduk values ile

 * sqlite:///veri_tabanları_sql.db
1 rows affected.

[]

In [11]:
%%sql
SELECT * FROM yeni_tablo;
# * burada hepsini alması demek

 * sqlite:///veri_tabanları_sql.db
Done.

[('ismet', 'soyadı'), ('ali', 'uzaya_git')]

In [12]:
%%sql
INSERT INTO yeni_tablo values('ismet', 'camiye_git');

 * sqlite:///veri_tabanları_sql.db
1 rows affected.

[]

In [13]:
%%sql
SELECT * FROM yeni_tablo;

 * sqlite:///veri_tabanları_sql.db
Done.

[('ismet', 'soyadı'), ('ali', 'uzaya_git'), ('ismet', 'camiye_git')]

### SELECT İşlemleri

In [15]:
%%sql # iki tane yüzde işareti koyduğumuzda alt satırda çalışıyor olabilececğiz, bir tanesi ile yan yana yazmak gerekli
SELECT * FROM Products LIMIT 5;

 * sqlite:///veri_tabanları_sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [16]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table' ;
# burada tabloları seçtik

 * sqlite:///veri_tabanları_sql.db
Done.

[('Products',),
 ('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Shippers',),
 ('Suppliers',),
 ('yeni_tablo',)]

In [17]:
%%sql
SELECT * FROM Customers where 1=0;
# customers altındaki değişkenlerin isimlerini yani columns'ı çevirdik

 * sqlite:///veri_tabanları_sql.db
Done.

[]

In [18]:
%%sql
SELECT * FROM Customers LIMIT 3;
# ilk 3 satır ve değişkenleri aldık

 * sqlite:///veri_tabanları_sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]

In [19]:
%%sql
SELECT CustomerName, City, Country FROM Customers LIMIT 3;
# * yerine değişkenleri yazabiliriz buraya

 * sqlite:///veri_tabanları_sql.db
Done.

[('Alfreds Futterkiste', 'Berlin', 'Germany'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.', 'Mexico'),
 ('Antonio Moreno Taquería', 'México D.F.', 'Mexico')]

In [20]:
%%sql
SELECT * from Products LIMIT 3;
# products değişkenini aldık

 * sqlite:///veri_tabanları_sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)]

In [23]:
%%sql
SELECT Price, Price*5, Price*5-100 from Products LIMIT 3;
# matematiksel işlemleri bu şekilde uygulayabiliriz

 * sqlite:///veri_tabanları_sql.db
Done.

[(18, 90, -10), (19, 95, -5), (10, 50, -50)]

In [36]:
%%sql
SELECT Price, Price*5, Price*5-100 AS islemli_price from Products LIMIT 3;
# alias : takma isim, kısayol 
# - kullanma hata dönüyor alt çizgi(_) kullan
# islem yaptığımız columns'a isim verdik

 * sqlite:///veri_tabanları_sql.db
Done.

[(18, 90, -10), (19, 95, -5), (10, 50, -50)]

In [ ]:
SELECT Sum(Value$), EmployeeID From paymentstable GROUP BY EmployeeID

In [ ]:
SELECT emp.EmployeeID, emp.FirstName, emp.LastName, pay.Value$ FROM employeetable emp LEFT OUTER JOIN paymentstable pay ON emp.EmployeeID = pay.EmployeeID ;

In [ ]:
SELECT EmployeeID, SUM(Value$) From paymentstable GROUP BY EmployeeID

In [ ]:
1- SELECT FirstName, LastName, SUM(Value$)  FROM (SELECT emp.EmployeeID, emp.FirstName, emp.LastName, pay.Value$ FROM employeetable emp INNER JOIN paymentstable pay ON emp.EmployeeID = pay.EmployeeID) GROUP BY EmployeeID   ; 
# first, we combined 2 tables. and then Assigned Names to make the code look simpler. We then grouped it with EmployeeID and collected the value$ values.

2 - SELECT * FROM employeetable WHERE FirstName LIKE 'J%'; 
# we used the like Command and it could be anything followed by '%' .